Public Attributes | List of all members
API_ElemComponentID Struct Reference
Element Manager API
Identifies a component of an element. More...
#include <APIdefs_Component.h>
 Public Attributes
API_Guid  | elemGuid
Guid of the element. componentID identifies a component that belongs to it.
API_ComponentID  | componentID
Identifier of the component.
Detailed Description
Identifies a component of an element.
Member Data Documentation
◆ componentID
 API_ElemComponentID::componentID
Identifier of the component.
◆ elemGuid
 API_ElemComponentID::elemGuid
Guid of the element. componentID identifies a component that belongs to it.